Revit 2027 API
BuiltInFailures.DimensionFailures.CannotCreateDimensionNotParallel Property
 Can't create dimension. Highlighted references are not parallel to first selection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateDimensionNotParallel { get; }
Public Shared ReadOnly Property CannotCreateDimensionNotParallel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateDimensionNotParallel {
	FailureDefinitionId^ get ();
}
static member CannotCreateDimensionNotParallel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace